Tekla.Structures.Filtering.DateTimeOperatorType
The DateTime operator type defines the operators between two DateTime filter expressions.

Tekla.Structures.Filtering.DateTimeOperatorType.IS_EQUAL
The "is equal" operator.

Tekla.Structures.Filtering.DateTimeOperatorType.IS_NOT_EQUAL
The "is not equal" operator.

Tekla.Structures.Filtering.DateTimeOperatorType.EARLIER_THAN
The "earlier than" operator.

Tekla.Structures.Filtering.DateTimeOperatorType.EARLIER_OR_EQUAL
The "earlier or equal" operator.

Tekla.Structures.Filtering.DateTimeOperatorType.LATER_THAN
The "later than" operator.

Tekla.Structures.Filtering.DateTimeOperatorType.LATER_OR_EQUEL
The "later or equal" operator.